Revit 2024 API
BRepBuilderPersistentIds Methods
The BRepBuilderPersistentIds type exposes the following members.
Methods
Name | Description
AddSubTag
 Adds a correspondence between an ExternalGeometryId and a BRepBuilderGeometryId. Note that an existing correspondence in the map cannot be updated and that a particular BRepBuilderGeometryId may be related to at most one ExternalGeometryId.
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsAssociatedBRepBuilderValid
 Validates the associated (in the constructor) BRepBuilder for this BRepBuilderPersistentIds.
IsBRepBuilderGeometryIdFaceOrEdge
 Validates the input BRepBuilderGeometryId that will be used to create a correspondence. In order to be valid, the input BRepBuilderGeometryId must represent the ID of either a Face or an Edge.
IsValidBRepBuilderGeometryIdForNewCorrespondence
 Validates the input BRepBuilderGeometryId that will be used to create a correspondence. In order to be valid, a correspondence for the input BRepBuilderGeometryId must not already exist.
IsValidExternalGeometryIdForNewCorrespondence
 Validates the input ExternalGeometryId that will be used to create a correspondence. In order to be valid, a correspondence for the input ExternalGeometryId must not already exist.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
BRepBuilderPersistentIds Class
Autodesk.Revit.DB Namespace